//начало текста модуля

#Область Служебные_функции_и_процедуры

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ФайлКлючейИФайлПереводенныхФраз()","ФайлКлючейИФайлПереводенныхФраз","Дано: Файл ключей и файл переводенных фраз");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"НажатаКнопка(Парам01)","НажатаКнопка","Когда Нажата кнопка ""Прочитать""");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"БудутПрочитаныФайлыИсходники()","БудутПрочитаныФайлыИсходники","Тогда Будут прочитаны файлы исходники");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ДвеСтрокиСКлючемИФразой()","ДвеСтрокиСКлючемИФразой","Дано: Две строки с ключем и фразой");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ПолученыСоответствующиеСтроки()","ПолученыСоответствующиеСтроки","Когда Получены соответствующие строки");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВыбраныНеобходимыеЧастиСтрок()","ВыбраныНеобходимыеЧастиСтрок","И Выбраны необходимые части строк");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"СозданаНоваяСтрокаКлючПереведеннаяФраза()","СозданаНоваяСтрокаКлючПереведеннаяФраза","Тогда Создана новая строка ключ переведенная фраза");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"СоставленыСтрокиПеревода()","СоставленыСтрокиПеревода","Когда Составлены строки перевода");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЗаписанНовыйФайлПревода()","ЗаписанНовыйФайлПревода","Тогда Записан новый файл превода");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции

#КонецОбласти



#Область Работа_со_сценариями

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Дано: Файл ключей и файл переводенных фраз
//@ФайлКлючейИФайлПереводенныхФраз()
Процедура ФайлКлючейИФайлПереводенныхФраз() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Когда Нажата кнопка "Прочитать"
//@НажатаКнопка(Парам01)
Процедура НажатаКнопка(Парам01) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Тогда Будут прочитаны файлы исходники
//@БудутПрочитаныФайлыИсходники()
Процедура БудутПрочитаныФайлыИсходники() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Дано: Две строки с ключем и фразой
//@ДвеСтрокиСКлючемИФразой()
Процедура ДвеСтрокиСКлючемИФразой() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Когда Получены соответствующие строки
//@ПолученыСоответствующиеСтроки()
Процедура ПолученыСоответствующиеСтроки() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//И Выбраны необходимые части строк
//@ВыбраныНеобходимыеЧастиСтрок()
Процедура ВыбраныНеобходимыеЧастиСтрок() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Тогда Создана новая строка ключ переведенная фраза
//@СозданаНоваяСтрокаКлючПереведеннаяФраза()
Процедура СозданаНоваяСтрокаКлючПереведеннаяФраза() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Когда Составлены строки перевода
//@СоставленыСтрокиПеревода()
Процедура СоставленыСтрокиПеревода() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Тогда Записан новый файл превода
//@ЗаписанНовыйФайлПревода()
Процедура ЗаписанНовыйФайлПревода() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

//окончание текста модуля